---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.FluidType.GetEnumerator
source: html/07f0208b-99ac-a800-d161-4821a1c7bd5e.htm
---
# Autodesk.Revit.DB.Plumbing.FluidType.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<FluidTemperature> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.